haikevins/secure-delta-ota-bootloader/node-stm32f103/application/src/main.c
#include <stdint.h>
#include "memory_map.h"
#include "ota_agent.h"
#include "phase4_flash_selftest.h"
#include "trial_confirmation.h"
#if defined(PHASE16_HIL_SANITIZE_EXTERNAL)
#include "external_flash_storage.h"
#endif
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"

#define STATUS_LED_PORT          GPIOC
#define STATUS_LED_PIN           GPIO_Pin_13
#define HEARTBEAT_PERIOD_MS      1000UL
#define HEARTBEAT_ON_TIME_MS     100UL
#define ERROR_TOGGLE_DELAY       180000UL

volatile uint32_t g_application_tick_ms;

void SysTick_Handler(void)
{
    ++g_application_tick_ms;
}

static void Application_LedInit(void)
{
    GPIO_InitTypeDef gpio;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    GPIO_StructInit(&gpio);
    gpio.GPIO_Pin = STATUS_LED_PIN;
    gpio.GPIO_Speed = GPIO_Speed_2MHz;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(STATUS_LED_PORT, &gpio);
    GPIO_SetBits(STATUS_LED_PORT, STATUS_LED_PIN);
}

static void Application_LedSet(uint8_t enabled)
{
    if (enabled != 0U) { GPIO_ResetBits(STATUS_LED_PORT, STATUS_LED_PIN); }
    else { GPIO_SetBits(STATUS_LED_PORT, STATUS_LED_PIN); }
}

static void Application_FatalBlink(void) __attribute__((noreturn));

static void Application_FatalBlink(void)
{
    for (;;)
    {
        volatile uint32_t delay;
        GPIO_WriteBit(STATUS_LED_PORT, STATUS_LED_PIN,
                      (BitAction)(1UL - GPIO_ReadOutputDataBit(
                          STATUS_LED_PORT, STATUS_LED_PIN)));
        for (delay = 0UL; delay < ERROR_TOGGLE_DELAY; ++delay) { __NOP(); }
    }
}

int main(void)
{
    Application_LedInit();

    if (SCB->VTOR != APPLICATION_START_ADDRESS) { Application_FatalBlink(); }
    if (SysTick_Config(SystemCoreClock / 1000UL) != 0UL)
    {
        Application_FatalBlink();
    }

#if defined(PHASE16_HIL_SANITIZE_EXTERNAL)
    /*
     * Phase-16 HIL baseline sanitizer.
     *
     * Each deterministic fault scenario must start with no stale download
     * checkpoint or install handoff from a previous run.  The two records
     * coexist in external Metadata A/B sectors. The Incoming partition is
     * also erased because a newly signed SDOT can share most bytes with a
     * previous artifact while differing in its ECDSA signature; NOR flash
     * cannot program 0 -> 1 without an erase.
     *
     * Reconstructed, Backup and Log partitions remain untouched here because
     * their owning bootloader paths erase/checkpoint them before use.
     *
     * This mode is never enabled in a production application build.
     */
    if (!ExternalFlashStorage_Init() ||
        !ExternalFlashStorage_ErasePartition(
            EXTERNAL_FLASH_PARTITION_METADATA_A) ||
        !ExternalFlashStorage_ErasePartition(
            EXTERNAL_FLASH_PARTITION_METADATA_B) ||
        !ExternalFlashStorage_ErasePartition(
            EXTERNAL_FLASH_PARTITION_INCOMING) ||
        !ExternalFlashStorage_IsErased(
            EXTERNAL_FLASH_PARTITION_METADATA_A,
            0UL,
            EXT_FLASH_SECTOR_SIZE) ||
        !ExternalFlashStorage_IsErased(
            EXTERNAL_FLASH_PARTITION_METADATA_B,
            0UL,
            EXT_FLASH_SECTOR_SIZE) ||
        !ExternalFlashStorage_IsErased(
            EXTERNAL_FLASH_PARTITION_INCOMING,
            0UL,
            EXT_INCOMING_SIZE))
    {
        Application_FatalBlink();
    }

    /* Solid LED is the local completion witness; runner waits before reflash. */
    Application_LedSet(1U);
    for (;;)
    {
        __WFI();
    }

#elif defined(PHASE4_HW_TEST)
    Phase4FlashSelfTest_Run();
    if (g_phase4_flash_test_status != PHASE4_FLASH_TEST_PASS)
    {
        Application_FatalBlink();
    }
#else
    if (!OtaAgent_Init()) { Application_FatalBlink(); }
    if (!TrialConfirmation_Init(g_application_tick_ms))
    {
        Application_FatalBlink();
    }
#endif

    for (;;)
    {
        const uint32_t phase = g_application_tick_ms % HEARTBEAT_PERIOD_MS;
#if !defined(PHASE4_HW_TEST) && !defined(PHASE16_HIL_SANITIZE_EXTERNAL)
        OtaAgent_Process();
        TrialConfirmation_Process(g_application_tick_ms);
#endif
        Application_LedSet((uint8_t)(phase < HEARTBEAT_ON_TIME_MS));
        __WFI();
    }
}
